{
  "meta": {
    "theme": "stackoverflow"
  },
  "basics": {
    "name": "Stéphane Bisinger",
    "label": "Software Engineer",
    "email": "stephane@sbisinger.ch",
    "website": "https://www.sbisinger.ch",
    "phone": "+41 79 635 2861",
    "summary": "Software Engineer with a variety of experiences both on the frontend and backend side of applications. I enjoy working in self-organizing teams who take ownership of the product they develop and work in a collaborative environment.",
    "location": {
      "city": "Zurich",
      "countryCode": "CH",
      "postalCode": "8053"
    },
    "profiles": [
      {
        "network": "Github",
        "username": "Kjir",
        "url": "https://github.com/Kjir"
      },
      {
        "network": "Gitlab",
        "username": "Kjir",
        "url": "https://gitlab.com/Kjir"
      }
    ]
  },
  "work": [
    {
      "name": "KOF - ETH Zürich",
      "position": "Scientific Software Engineer",
      "website": "https://kof.ethz.ch",
      "startDate": "2022-10",
      "summary": "The KOF Swiss Economic Institute is a forward-looking research institute that analyses economic developments relevant to Switzerland.",
      "highlights": [
        "Stabilized and improved processes to import data from external sources. Improved the error reporting and automated the recovery processes.",
        "Automated deployments of applications and packages by creating shared reusable templates for the Gitlab CI/CD pipelines.",
        "Moved the infrastructure and the Airflow DAGs to Kubernetes. Switched to an on-demand workload in place of always-on servers.",
        "Supported researchers and their assistants with development efforts: identifying root causes of errors, identifying bad data, improving code structure and optimizing the performance of the code.",
        "Improved infrastructure maintenance, monitoring and tooling. Introduced missing tools like a password manager and Prometheus/Grafana.",
        "Technologies used: R, Kubernetes, MATLAB, Airflow, PostgreSQL, Python, Javascript, Vue, React, PHP"
      ]
    },
    {
      "name": "Rentouch GmbH",
      "position": "Senior Software Engineer",
      "website": "https://www.piplanning.io",
      "startDate": "2020-09",
      "endDate": "2022-09",
      "summary": "Rentouch develops the piplanning app, which enables SAFe PI planning sessions remotely. It is a whiteboard with stickies that can be synchronized to Jira/Azure DevOps/Rally.",
      "highlights": [
        "Developed the frontend applications while creating a library of shared, reusable components documented in a styleguide.",
        "Added functionalities and optimized existing code in the Python microservices.",
        "Gradually migrated the messaging system from WAMP to NATS",
        "Introduced several practices to improve quality and speed of development, like a living styleguide, reusable components and maintainable tests.",
        "Improved the security of the application. This includes the creation of Proof-of-Concepts to demonstrate the potential issue.",
        "Helped both business and development side to apply the Pareto principle and release with an incremental approach.",
        "Introduced concepts and tools to improve the observability of the system. This includes error reporting, automatic tracing and collection of metrics.",
        "Technologies used: Python, Javascript/Typescript, Vue, Kubernetes, Websockets, PostgreSQL, MongoDB"
      ]
    },
    {
      "name": "42talents GmbH",
      "position": "Software Crafter",
      "website": "https://42talents.com",
      "startDate": "2020-04",
      "endDate": "2020-06"
    },
    {
      "name": "Homegate AG",
      "position": "Senior Software Engineer",
      "website": "https://www.homegate.ch",
      "startDate": "2018-08",
      "endDate": "2020-03",
      "summary": "Homegate is one of the biggest marketplaces for properties and apartments in Switzerland. I was part of the teams reengineering the notification system for new properties and the product display page.",
      "highlights": [
        "Guided the team to achieve Continuous Delivery with automated QA, pair programming, fast iterations and complete automation.",
        "Started the journey to observability through tools like Datadog and Sentry.",
        "Solved complex and novel problems like Server-Side Rendering and Code Splitting in a serverless context.",
        "Lead technical decisions in collaboration with the rest of the team.",
        "Held a course on Webpack for the TX Academy.",
        "Technologies used: AWS, nodejs, webpack, Vue, NoSQL, Serverless"
      ]
    },
    {
      "name": "siroop AG",
      "position": "Senior Software Engineer",
      "website": "https://www.siroop.ch",
      "startDate": "2018-02",
      "endDate": "2018-07",
      "summary": "siroop was an online marketplace for Switzerland",
      "highlights": [
        "Worked on the streaming data pipeline for product and price updates from merchants.",
        "Rewrote the pipeline to process product categories and support internationalization.",
        "Refactored a Flask API to be able to switch between DynamoDB and Elasticsearch as source for data.",
        "Wrote an alternative entrypoint for product data using RabbitMQ as a source.",
        "Took a leading role in the analysis, planning and implementation of a product promotion.",
        "Technologies used: AWS, nodejs, Python, Django, RabbitMQ, NoSQL, PostgreSQL"
      ]
    },
    {
      "name": "Renuo AG",
      "position": "Full Stack Developer",
      "website": "https://www.renuo.ch",
      "startDate": "2016-11",
      "endDate": "2018-02",
      "summary": "Renuo is a web agency specialized in Ruby on Rails and Angular. Among my duties and accomplishments are:",
      "highlights": [
        "The development of a Ruby on Rails and Angular 2 single page application for a big insurance company.",
        "Taking responsibility for all the servers, reorganizing them and promoting a shift towards a cloud/serverless architecture.",
        "Training interns and junior developers through pair programming, live coding and presentations.",
        "Technologies used: Ruby on Rails, Angular, HTML, CSS, PostgreSQL"
      ]
    },
    {
      "name": "Vendini",
      "position": "Senior Software Engineer",
      "website": "https://vendini.com/",
      "startDate": "2015-07",
      "endDate": "2016-09"
    },
    {
      "name": "TeamSystem SpA",
      "position": "Senior Software Engineer",
      "website": "https://www.teamsystem.com/",
      "startDate": "2013-05",
      "endDate": "2015-06"
    },
    {
      "name": "Various positions",
      "position": "Software Engineer",
      "startDate": "2006-11",
      "endDate": "2013-04"
    }
  ],
  "education": [
    {
      "institution": "Università di Bologna",
      "area": "Computer Science",
      "studyType": "Bachelor",
      "startDate": "2003-09",
      "endDate": "2010-10"
    }
  ],
  "skills": [
    {
      "name": "Backend Development",
      "keywords": [
        "Python",
        "Ruby on Rails",
        "Node",
        "PostgreSQL",
        "MongoDB",
        "Kubernetes"
      ]
    },
    {
      "name": "Frontend Development",
      "keywords": [
        "Javascript",
        "Vue.js",
        "Vite",
        "Webpack",
        "HTML",
        "CSS"
      ]
    },
    {
      "name": "AWS",
      "keywords": [
        "DynamoDB",
        "Lambda",
        "SQS",
        "Serverless"
      ]
    },
    {
      "name": "Agile",
      "keywords": [
        "Test-Driven Development",
        "Pair Programming",
        "Continuous Delivery"
      ]
    }
  ],
  "languages": [
    {
      "language": "Italian",
      "fluency": "Native speaker"
    },
    {
      "language": "French",
      "fluency": "Native speaker"
    },
    {
      "language": "English",
      "fluency": "Very fluent"
    },
    {
      "language": "German",
      "fluency": "Around C1 level"
    }
  ]
}
